       IDENTIFICATION DIVISION.
      * Cobol game
       PROGRAM-ID. cobolgame.
       PROCEDURE DIVISION.
       DISPLAY "Hello, world!"
       STOP RUN.
